我一直相信释迦牟尼说过的一句话： “无论你遇见谁，他都是你生命该出现的人，绝非偶然，他一定会教会你一些什么”。所以我也相信：“无论我走到哪里，那都是我该去的地方，经历一些我该经历的事，遇见我该遇见的人”
夜未央。 华年正当。 乐未殇。 烈酒满樽。 何让如此韶华空逝。 夜已深。 眉目困乏。 志难抒。 鏖糟一肚。 何让这般年华如斯。
人生有三把钥匙：接受、改变、离开。不能接受的就改变，不能改变的就离开。少问别人为什么，多问自己凭什么。得之坦然、失之淡然、顺其自然 。
我们在这个有10^{90} 个基本粒子的宇宙中，它的物质是有限的，排列组合也是有限的。只要它持续演化10^{10^{122} } 年，总会回到以前经历过的某个状态。 尽管这个时间长得没办法想象，但总有一天，那时，你还是你，我还是我，宇宙还是这个宇宙，一切都回到现在。 同样，在很久以前，我们都曾出现过。
你得到的不一定是你得到的，你失去的才是你真正的得到。
对于很多人来说，音乐能做什么？能在紧张的时候让你放松，能在失落的时候让你坚强，能在低沉的时候让你勇敢。
Love doesn't walk away, people do.爱是不会离开你的，会离开你的是人。 ​
黄色的树林里分出两条路 我选择了人迹更少的一条 从此决定了我一生的道路
人之所迷，因在局内，人之所悟，因在局外。人生充满变数，定力如何，直接影响到人生的走向。淡定看人生，宁静看自.
我不渴望那种超人类的天赋 我要的 只不过是想能拥有一份适合自己平凡的爱
我并不渴求那些超人般的天赋，只求有能够挽留你的能力
我不想接触人世间的尔虞我诈，人情世故，我想做自在的自己，可是真的好难！
在喧闹的城市中，你我都忘记彼此。也许，回归平静之后，才会忆起曾经点滴。
谁为你倾尽年华，谁又为你海角天涯
给我一颗悲悯不能停的心，刚给我一个欲望无限的灵魂，给我一对望穿星河的眼睛,一个低庸下俗满足欲望的故事。
《银魂》里有一句台词说：“等你们长大成人了就会明白，人生还有眼泪也冲刷不干净的巨大悲伤，还有难忘的痛苦让你们即使想哭也不能流泪，所以真正坚强的人，都是越想哭反而笑得越大声，怀揣着痛苦和悲伤，即使如此也要带上它们笑着前行。”
时光荏苒，那个人已不是恋人， 也成不了朋友，无关喜欢， 只是会很习惯的想起。 每个人心中都有一座城， 住着一个不可能的人， 那个人路过了青春一阵子， 却会在记忆里搁浅一辈子。
清心如水，清水即心。微风无起，波澜不惊。幽篁独坐，长啸鸣琴。禅寂入定，毒龙遁行。我心无窍，天道酬勤。我义凛然，鬼魅皆惊。我情豪溢，天地归心。我志杨迈，水起风生。天高地阔，流水行云。清新治本，直道谋生。至性至善，大道天成。
一生中最幸运的两件事： 一件是时间终于将我对你的爱，消耗殆尽； 一件是很久很久以前有一天，我遇见你。

Before the morning sun, when life was lonely
黎明还未照耀前 孤独的我无人相伴
“躲了一辈子雨，雨会不会很难过？

真不知道你们每天炫耀个什么劲？做人低调点。我住在40多亿年的地球，晒着五十多亿年的太阳️！每天乘坐几千万的地铁，你见我炫耀了？天天和中国最大通讯公司移动联通电信保持合作关系，长期与世界连锁沃尔玛有业务来往，连我用的电脑都是比尔盖茨亲自帮我设计的系统，我炫耀了吗？
刚上公交车，一个小萝莉在我背后拿着魔法棒玩，她拿着魔杖指着我的后背，说要把我变成全世界最帅的男人。我听完，我笑了，然后回头。小女孩突然大叫，妈妈，我会魔法了。！
女孩问男孩：ABCDEFG是什么意思？男孩回答：A boy can do everything for girl（一个男孩可以为女孩做任何事） 很多人告诉女孩后面还有HIJK－He is just kidding（他只是在开玩笑） 女孩笑了笑说：就算他骗我也没关系……因为后面还有LMNOP－Love must need our patience（爱情需要付出耐心)
浩瀚宇宙，苍茫音海 与吾之星，寄吾之声 星璇不止，韵律长存。
敬启我的友人。我的向导，我的爱人，我的光芒。 在遇到你之后，我对世界的看法就完全改变了。 我不再偏执自大了。 如今我看到的和你是否有一丝相近了？ 我们相信不一样的宗教，然而我们依旧在一起。 世界上所有信仰都平等，万物都将归于过往。 所有人都会被理解，不会被排斥。 以己度人，博爱苍生。
唯黄昏而思烛明 唯覆雪始念日暖 唯放手方知情真 今困苦而怀峥嵘 今飘零而涌乡愁 今孑然而徒唏嘘 唏嘘成愁
人生中要走很多路，有一条路不能回头，就是放弃的路；有一条路不能拒绝，就是成长的路；有一条路不能迷失，就是信念的路；有一条路不能停滞，就是奋斗的路；有一条路不能忘记，就是回家的路；信心满满的走好脚下的每条路，生命中的每一天都很精彩。
最心痛的不是“We don't talk anymore”，而是“We don't know what to say”
每一个人死于永无止尽的自我束缚且活在其中。
Love doesn't walk away, people do.爱是不会离开你的，会离开你的是人。 ​